app/controllers/domains_controller.rb

  def index
    @domains = Domain.all
---
SELECT "domains".* FROM "domains"

  def create
    @domain = Domain.new(domain_params)

    url = URI.parse(@domain.url)
    if url.scheme == 'https'
      begin
        res = Net::HTTP.get_response(url)
      rescue
      end
    end

    if res.is_a?(Net::HTTPOK) && @domain.save
---
INSERT INTO "domains" ("url", "created_at", "updated_at") VALUES (?, ?, ?)  [["url", "https://www.gcn.ua"], ["created_at", "2016-02-26 14:17:16.125378"], ["updated_at", "2016-02-26 14:17:16.125378"]]